
&НаКлиенте
Процедура ПриОткрытии()
	ОбучениеПроведено = Ложь;
КонецПроцедуры

&НаСервере
Функция ОбучитьНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	ТаблицаПараметров = ДанныеФормыВЗначение(Объект.ТаблицаПараметров, Тип("ТаблицаЗначений"));
	
	НаборЗаписейИстория = РегистрыСведений.пп_ИсторияРаботыПользователя.СоздатьНаборЗаписей();
	НаборЗаписейИстория.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
	НаборЗаписейИстория.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписейИстория.Прочитать();
	КоличествоСловВИсторииПользователя = 7;
	
	ТаблицаЗаписей = НаборЗаписейИстория.ВыгрузитьКолонки();
	
	ОбучениеПроведено = Ложь;
	
	Счетчик = 0;
	Для Каждого Стр Из Объект.ТаблицаОбучения Цикл
		
		Если Стр.ОбъектВБазе <> Неопределено Тогда
			Движение = ТаблицаЗаписей.Добавить();
			Движение.Период = ТекущаяДата();
			Движение.Месяц = Месяц(ТекущаяДата());
			Движение.Пользователь = Пользователи.ТекущийПользователь();
			Движение.Объект = Стр.ОбъектВБазе;
			Движение.Наименование = НРег(Стр.Параметр);
			Движение.Количество = 1;
			Движение.Номер = Счетчик;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Номенклатура") Тогда
					Движение.Тип = "номенклатура";	
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Контрагенты") Тогда
					Движение.Тип = "контрагент";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
					Движение.Тип = "контактноелицо";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					Движение.Тип = "номенклатурнаягруппа";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Организации") Тогда
					Движение.Тип = "организация";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Пользователи") Тогда
					Движение.Тип = "user";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Склады") Тогда
					Движение.Тип = "склад";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Регионы") Тогда
					Движение.Тип = "регион";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.ПредприятияИзготовители") Тогда
					Движение.Тип = "производитель";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Производители") Тогда
					Движение.Тип = "производитель";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				Если ТипЗнч(Стр.ОбъектВБазе) = Тип("СправочникСсылка.Подразделения") Тогда
					Движение.Тип = "подразделение";
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			МассивСлов = Обработка.РазложитьСтроку(Движение.Наименование);
			КоличествоСловВПараметре = МассивСлов.Количество();
			
			Индекс = 0;
			Пока Индекс < КоличествоСловВИсторииПользователя Цикл
				Если Индекс < КоличествоСловВПараметре Тогда
					Движение["Слово" + Индекс] = МассивСлов[Индекс];
				Иначе
					Движение["Слово" + Индекс] = "";
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
			
			Счетчик = Счетчик + 1;
			
			НовПараметр = Обработка.ТаблицаПараметров.Добавить();
			НовПараметр.Наименование = Стр.Параметр;
			НовПараметр.Параметр = Стр.ОбъектВБазе;
			
			ОбучениеПроведено = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписейИстория.Загрузить(ТаблицаЗаписей);
	
	НаборЗаписейИстория.Записать(Ложь);
	
	Объект.ТаблицаОбучения.Очистить();
	Возврат ОбучениеПроведено; 
	
КонецФункции

&НаКлиенте
Процедура Обучить(Команда)
	
	Результат = ОбучитьНаСервере();
	Закрыть(Результат);
КонецПроцедуры

